Autodesk.Revit.DB.FailuresAccessor.JournalFailures(System.Collections.Generic.IList{Autodesk.Revit.DB.FailureMessageAccessor})
Allows to record information about failures in the journal.
Remarks:
Records information about failure messages and elements involved in the failures.
If this method not invoked, journal does not contain any information about failures
resolved by (pre)processing.
failures:
Accessors to the failures to journal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetAttemptedResolutionTypes(Autodesk.Revit.DB.FailureMessageAccessor)
Returns list of the failure resolution types attempted for the failure in the current transaction.
Remarks:
In some cases attempt to resolve a failure has no impact or failure gets reposted during next round of the end of transaction checks
after being resolved. Knowing if any failure resolutions were attempted for the failure allows failures processor
to prevent infinite loop.
failure:
The failure.
Returns:
The list of the types of failure resolutions attempted for the failure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteElements(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Resolves failures by deletion of elements related to the failures.
idsToDelete:
Ids of elements to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the failures by deleting idsToDelete is not permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ResolveFailures(System.Collections.Generic.IList{Autodesk.Revit.DB.FailureMessageAccessor})
Resolves one or more failures using last set failure resolution type for each of the failures.
If failure resolution type was not set for some of failures, default failure resolution type will be used.
Remarks:
After execution of the failure resolutions the failures will not be removed from the document automatically. To
prevent failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit.
It will cause failures to be regenerated and failure resolution process to be restarted.
If attempt to resolve failure was not successful, and the same failure is present on repetitive calls
of the failures (pre)processor, 	the preprocessor code should take care to attempt
a different resolution the next time the failure appears, to avoid an infinite loop.
failures:
The accessors to the failures to be resolved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Default resolution of one of the failures is not permitted or not applicable.
-or-
One of the failures was already attempted to resolve twice with that resolution type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
Resolution of failures is not permitted in the current state of the document.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ResolveFailure(Autodesk.Revit.DB.FailureMessageAccessor)
Resolves one failure using the failure resolution type last set for it.
Remarks:
If failure resolution type was not set, the default failure resolution type will be used.
After execution of the failure resolution the failure will not be removed from the document automatically. To
prevent the failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit.
It will cause failures to be regenerated and failure resolution process to be restarted.
If attempt to resolve failure was not successful, and the same failure is present on repetitive calls
of the failures (pre)processor, 	the preprocessor code should take care to attempt
a different resolution the next time the failure appears, to avoid an infinite loop.
failure:
The accessor to the failure to be resolved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
-or-
failure does not have any resolutions.
-or-
Default resolution of failure is not permitted or not applicable.
-or-
The failure was already attempted to resolve twice with that resolution type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
Resolution of failures is not permitted in the current state of the document.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteWarning(Autodesk.Revit.DB.FailureMessageAccessor)
Deletes one specific failure message of severity "Warning".
failure:
The accessor to the warning to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
-or-
Severity of failure is not FailureSeverity::Warning.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.PostFailure(Autodesk.Revit.DB.FailureMessage)
Posts an additional failure message to be processed for the current transaction.
Remarks:
Should be used during failures processing instead of a similar method in a document class.
Using method of the document class with the same name during failures processing is prohibited.
failure:
Failure message to post.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ReplaceFailures(Autodesk.Revit.DB.FailureMessage)
Deletes all failure messages currently posted in a document and replaces them with one "generic" failure.
Remarks:
If analysis done by Failures Processing code concludes that in a given context delivering
of the posted failures to the user makes no sense, this method can be used to discard all posted failures
and substitute one "generic" one, that will be delivered to the user and then transaction
forced to be aborted.
After the call, (pre)processing of failures should return ProceedWithRollback.
failure:
FailureMessage that should replace all currently posted messages. It must have severity DocumentCorruption.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Severity of failure must be FailureSeverity::DocumentCorruption.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.SetFailureHandlingOptions(Autodesk.Revit.DB.FailureHandlingOptions)
Sets failure handling options for the transaction currently being finished.
Remarks:
If used with returning ProceedWithRollback from (pre)processing, allows to dismiss errors and roll back transaction
without any further failures processing and silently for the user.
options:
The failure handling options to be set for the transaction currently being finished.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String@)
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
reason:
A localized string explaining reason why the elements cannot be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements exist and can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted(Autodesk.Revit.DB.FailureMessageAccessor,Autodesk.Revit.DB.FailureResolutionType)
Checks if resolution of the failure using given resolution type is permitted.
failure:
Accessor to the failure to be resolved.
resolutionType:
Type of the failure resolution to be used.
Returns:
True if resolution of the failure using given resolution type is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted(Autodesk.Revit.DB.FailureMessageAccessor)
Checks if default resolution of the failure is permitted.
failure:
The accessor to the failure to be resolved.
Returns:
True if default resolution of the failure is permitted
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.SetTransactionName(System.String)
Changes the name of the transaction for which failures are being processed.
Remarks:
If the transaction will be committed by or after failures processing it can change its name to reflect
results of processing of the failures. For example, if the original transaction name was "review warnings" and
some of the warnings were resolved by deleting of the relevant elements, failures processor may
change the name of the transaction to "delete elements".
transactionName:
The name of the transaction to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
transactionName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011